0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(walls|bottom|baffle.*)"
    {
        type       noSlip;
    }

    top
    {
        type       slip;
    }

    inlet
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  constant 10;
    }

    outlet
    {
        type       zeroGradient;
    }
}

// ************************************************************************* //
