0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-03;

boundaryField
{
    "(walls|top|bottom|baffle.*)"
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           uniform 0;
    }
}


// ************************************************************************* //
