system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-06;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent               yes;

    residualControl
    {
        p                1e-3;
        U                1e-4;
        "(k|epsilon)"    1e-4;
    }
}



relaxationFactors
{
    equations
    {
        p               1.0;
        "U|k|epsilon"   0.9;
    }
}


// ************************************************************************* //
